# RoutingConditions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingConditions Class
Members See Also
---
RoutingConditions contain routing information that is used as input when determining if a routing criterion, such as minimum or maximum diameter, is met.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class RoutingConditions : IDisposable
```

Visual Basic
---
```text
Public Class RoutingConditions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RoutingConditions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RoutingConditions
# See Also
RoutingConditions Members
Autodesk.Revit.DB Namespace